{
  "backend/main.mo": "Motoko canister implementing user profiles, video posts, comments, follows, and notifications with access control and blob storage integration.",
  "feature_evidence.json": "Feature evidence report describing required UI updates for the Landing/Login page's primary login button.",
  "frontend-file-summaries.txt": "Pre-written summaries of all frontend files, describing their purpose across routing, pages, components, hooks, and styling.",
  "frontend/index.css": "Tailwind CSS config defining light and dark theme color tokens and base styles for the app.",
  "frontend/index.html": "HTML entry point loading the React app root and main script with metadata and favicon.",
  "frontend/src/App.tsx": "Main React app wiring authentication, routing, and profile setup gating using TanStack Router and Internet Identity.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first‑time users to create a username with validation and profile save mutation.",
  "frontend/src/components/comments/CommentsSheet.tsx": "Bottom sheet for viewing and adding comments on a video post with author avatars and timestamps.",
  "frontend/src/components/common/ScreenStates.tsx": "Reusable loading, error, and empty state UI components for consistent screen feedback.",
  "frontend/src/components/feed/EngagementBar.tsx": "Displays like and comment buttons for a video post with stateful like handling and a comments sheet toggle.",
  "frontend/src/components/feed/VideoPostViewer.tsx": "Renders an auto‑playing video post with play controls, creator info, and caption overlay using an intersection observer.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, logout, content area, and bottom navigation with notification badges.",
  "frontend/src/components/profile/EditProfileDialog.tsx": "Dialog for editing a user profile, including username, bio, and avatar upload with validation and save handling.",
  "frontend/src/components/profile/FollowButton.tsx": "Provides a follow button that reflects follow status and triggers follow mutations for a given user.",
  "frontend/src/components/profile/ProfilePostsList.tsx": "Displays a grid of user video posts with thumbnails, hover overlays, and timestamp info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity login, logout, and identity state management using AuthClient with context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, video posts, notifications, and follow actions, wrapping backend actor calls.",
  "frontend/src/index.css": "Configures Tailwind base styles and custom CSS variables for light and dark themes, plus global styling utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/FeedPage.tsx": "Displays a scrollable feed of video posts with loading, error, and empty states.",
  "frontend/src/pages/LandingLoginPage.tsx": "Landing page with branding and a login button using Internet Identity, plus basic feature highlights.",
  "frontend/src/pages/MessagesPage.tsx": "Messages overview page showing an empty-state placeholder.",
  "frontend/src/pages/MessageThreadPage.tsx": "Shows a message thread placeholder for a specific user, resolving their principal and profile.",
  "frontend/src/pages/NotificationsPage.tsx": "Lists user notifications with icons, timestamps, and a control to mark items as read.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user profile with posts, followers, and edit or follow actions, using multiple data hooks.",
  "frontend/src/pages/UploadPage.tsx": "React page for uploading a video with validation, progress tracking, and submission via createPost, then navigating to the profile page.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and manipulating hash‑based query params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and container settings with plugins for typography, container queries, and animations.",
  "project_state.json": "JSON file describing project metadata, feature set, known issues, and architectural notes for the Helmar app."
}