{
  "backend/main.mo": "Defines user profiles, video posts, comments, follows, and notifications with access control and storage mixins, and exposes CRUD-style profile and phone verification functions.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten one‑sentence summaries for major frontend files including pages, components, hooks, and layout elements.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light and dark themes and applying base UI styles.",
  "frontend/index.html": "HTML entry point setting up branding, metadata, favicon cache-busting, and mounting the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, authentication gating, profile-loading logic, and global layout with optional profile setup modal.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to create a username and submit an initial profile via a backend mutation.",
  "frontend/src/components/comments/CommentsSheet.tsx": "Bottom-sheet UI for viewing and adding comments on a video post, including author lookup, scrolling list, and input form.",
  "frontend/src/components/common/ScreenStates.tsx": "Provides reusable loading, error, and empty state UI components.",
  "frontend/src/components/feed/EngagementBar.tsx": "Renders like and comment buttons for a video post and handles like and comment interactions.",
  "frontend/src/components/feed/VideoPostViewer.tsx": "Displays an auto-playing video post with creator info, caption, and engagement controls.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout including header, navigation, and logout handling.",
  "frontend/src/components/profile/EditProfileDialog.tsx": "Modal dialog for editing a user profile, including avatar upload and form submission.",
  "frontend/src/components/profile/FollowButton.tsx": "Button component to follow or unfollow a user based on current relationship state.",
  "frontend/src/components/profile/PhoneVerificationSection.tsx": "Handles phone number input, sending verification codes, and confirming verification status.",
  "frontend/src/components/profile/ProfilePostsList.tsx": "Displays a grid of the user's video posts with preview thumbnails and timestamps.",
  "frontend/src/config/branding.ts": "Contains app branding constants including name, description, and build version.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login flow, and stored identity loading through a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, phone verification, video posts, likes, and notifications using the backend actor.",
  "frontend/src/index.css": "Tailwind base stylesheet defining theme variables, dark mode colors, and global scrollbar/element styles.",
  "frontend/src/main.tsx": "Bootstraps the app with ReactDOM, providing React Query and Internet Identity context providers.",
  "frontend/src/pages/FeedPage.tsx": "Displays the scrolling video feed and handles loading, error, and empty states.",
  "frontend/src/pages/LandingLoginPage.tsx": "Renders the branded login page with Internet Identity login, background visuals, and feature highlights.",
  "frontend/src/pages/MessagesPage.tsx": "Displays the messages overview page with an empty-state placeholder.",
  "frontend/src/pages/MessageThreadPage.tsx": "Shows a message thread header for a specific user and a placeholder empty conversation view.",
  "frontend/src/pages/NotificationsPage.tsx": "Lists notifications with icons, timestamps, and allows marking items as read, handling loading and empty states.",
  "frontend/src/pages/ProfilePage.tsx": "Displays a user's profile with bio, posts, follower stats, edit options, and phone verification badges, loading data via multiple hooks. Handles validation of user IDs and conditional rendering for errors or missing profiles.",
  "frontend/src/pages/UploadPage.tsx": "Provides a form to upload a video with title and description, including file validation, progress tracking, and submission to create a new post. Navigates to the user profile after a successful upload.",
  "frontend/src/pages/UserSearchPage.tsx": "Implements a user search interface with debounced queries, loading and error states, and clickable results navigating to user profiles. Allows clearing and submitting search terms.",
  "frontend/src/utils/assetVersion.ts": "Adds a cache-busting version query parameter to asset URLs using the build ID.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions for reading, persisting, and clearing URL parameters across query strings, hash routing, and session storage.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines overall project state for the Helmar social video app, including metadata, architectural notes, known issues, and a list of existing feature modules. Acts as the central snapshot for build planning and tracking."
}